# LightShape Methods

---
The LightShape type exposes the following members.
| Name| Description
---|---|---
| Clone|  Creates a copy of the LightShape derived object.
| Dispose|
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
LightShape Class
Autodesk.Revit.DB.Lighting Namespace